aivx/HEXAPOD_STM32F103RET6/HEXAPOD_STM32F103RET6/Src/main.c
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_I2C2_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_TIM4_Init();
  MX_TIM5_Init();
  MX_TIM8_Init();
  MX_UART4_Init();
  /* USER CODE BEGIN 2 */

  HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_4); TIM3->CCR4=servoWrite(90);	//1_1
  HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_3); TIM3->CCR3=servoWrite(90);	//1_2
  HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_2); TIM3->CCR2=servoWrite(120);	//1_3

  HAL_TIM_PWM_Start(&htim5,TIM_CHANNEL_4); TIM5->CCR4=servoWrite(90);	//2_1
  HAL_TIM_PWM_Start(&htim5,TIM_CHANNEL_3); TIM5->CCR3=servoWrite(90);	//2_2
  HAL_TIM_PWM_Start(&htim5,TIM_CHANNEL_2); TIM5->CCR2=servoWrite(120);	//2_3

  HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_1); TIM4->CCR1=servoWrite(90);	//3_1
  HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_1); TIM3->CCR1=servoWrite(90);	//3_2
  HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_4); TIM1->CCR4=servoWrite(120);	//3_3

  HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_4); TIM4->CCR4=servoWrite(90);	//4_1
  HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_3); TIM4->CCR3=servoWrite(90);	//4_2
  HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_2); TIM4->CCR2=servoWrite(70);	//4_3

  HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_1); TIM1->CCR1=servoWrite(90); 	//5_1
  HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_2); TIM1->CCR2=servoWrite(90); 	//5_2
  HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_3); TIM1->CCR3=servoWrite(70); 	//5_3

  HAL_TIM_PWM_Start(&htim8,TIM_CHANNEL_1); TIM8->CCR1=servoWrite(90); 	//6_1
  HAL_TIM_PWM_Start(&htim8,TIM_CHANNEL_2); TIM8->CCR2=servoWrite(90); 	//6_2
  HAL_TIM_PWM_Start(&htim8,TIM_CHANNEL_3); TIM8->CCR3=servoWrite(70); 	//6_3


  HAL_TIM_PWM_Start(&htim2,TIM_CHANNEL_1); TIM2->CCR1=45535;
  HAL_TIM_PWM_Start(&htim2,TIM_CHANNEL_2); TIM2->CCR2=45535;


  HAL_TIM_PWM_Start(&htim8,TIM_CHANNEL_4); TIM8->CCR4=0; // not use
  HAL_TIM_PWM_Start(&htim5,TIM_CHANNEL_1); TIM5->CCR1=0; // not use
  /* USER CODE END 2 */

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadDef(defaultTask, StartDefaultTask, osPriorityNormal, 0, 128);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* definition and creation of myTask02 */
  osThreadDef(myTask02, StartTask02, osPriorityIdle, 0, 128);
  myTask02Handle = osThreadCreate(osThread(myTask02), NULL);

  /* definition and creation of myTask03 */
  osThreadDef(myTask03, StartTask03, osPriorityIdle, 0, 128);
  myTask03Handle = osThreadCreate(osThread(myTask03), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */
 

  /* Start scheduler */
  osKernelStart();
  
  /* We should never get here as control is now taken by the scheduler */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV16;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV16;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 15, 0);
}

/* I2C2 init function */
static void MX_I2C2_Init(void)
{

  hi2c2.Instance = I2C2;
  hi2c2.Init.ClockSpeed = 100000;
  hi2c2.Init.DutyCycle = I2C_DUTYCYCLE_2;
  hi2c2.Init.OwnAddress1 = 0;
  hi2c2.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c2.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
  hi2c2.Init.OwnAddress2 = 0;
  hi2c2.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
  hi2c2.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
  if (HAL_I2C_Init(&hi2c2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

